// ВАЖНО!! В "Headers" необходимо указать ваш API KEY
// Сумма всех налогов в чеке, с учетом налогов на сидку и наценку, должна быть положительной.

{
    "Token": "ac3c67f5ef674fe8a150849f20173b68", // укажите токен авторизации
    "CashboxUniqueNumber": "SWK00033717", // укажите ЗНК (заводской номер кассы)
    "OperationType": 2, // Тип операции (0 - покупка, 1 - возврат покупки, 2 - продажа, 3 - возврат продажи)
    "Positions": [ // Позиция товара/услуги в чеке
        {
            "Count": 1, // Количество
            "Price": 500, // Цена
            "TaxPercent": 12, // Налоговая ставка
            "Tax": 53.57, // Налог (в тенге)
            "TaxType": 100, // Тип налога (0 - без налога, 1 - НДС)
            "PositionName": "Marlboro", // Наименование позиции
            "PositionCode": "1", // НЕОБЯЗАТЕЛЬНОЕ ПОЛЕ. Код позиции 
            "Discount": 0, // НЕОБЯЗАТЕЛЬНОЕ ПОЛЕ. Скидка (в тенге)
            "Markup": 0, // НЕОБЯЗАТЕЛЬНОЕ ПОЛЕ. Наценка (в тенге)
            "SectionCode": "1", // НЕОБЯЗАТЕЛЬНОЕ ПОЛЕ. Код секции
            "UnitCode": 796, // Единица измерения. Можно посмотреть в запросе Справочник "Единицы измерения" 
            "Mark": "0104603276013765213A8B06OMH52K291KZF092THdacgzKM1saamrh6LNd8AazrDfKqJDZSE2BKKqk3so=", // НЕОБЯЗАТЕЛЬНОЕ ПОЛЕ. Код маркировки. Используется для передачи только одного кода маркировки в позиции (когда количество товара = 1).
            "MarkList": [ //НЕОБЯЗАТЕЛЬНОЕ ПОЛЕ. Массив Кодов маркировки. Может использоваться только для касс, работающих на версии протокола передачи данных в ОФД 2.0.3 или выше. Может содержать коды маркировок только одного вида товаров. В позиции может использоваться только один вариант передачи маркировки: через поле Mark или через массив MarkList, например, Цитрамон 10 штук, может быть передан как одна товарная позиция с количеством = 10, и с 10 элементами в массиве MarkList или как 10 отдельных позиций с количеством = 1 и по одному коду маркировки в каждой позиции в поле Mark.
            "04870249811936t1Xrb-xQWhpeGhG",
            "04870249811936'dTOZwQTEMrcDNE"
             ],
            "GTIN":"4870249811936", // Штрихкод ОБЯЗАТЕЛЬНО, ЕСЛИ Признак типа склада указан как Виртуальный склад (=1) И ProductId (ID продукта на Виртуальном складе) отсутствует
            "NTIN":"0200000000001", // Штрихкод, присовенный товару Национальным Каталогом Товаров РК. ОБЯЗАТЕЛЬНО, ЕСЛИ Признак типа склада указан как Виртуальный склад (=1) И ProductId (ID продукта на Виртуальном складе) отсутствует
            "ProductId": "14304", // ID продукта на Виртуальном складе. ОБЯЗАТЕЛЬНО, ЕСЛИ Признак типа склада указан как Виртуальный склад (=1) И GTIN (штрихкод) отсутствует
            "WarehouseType": 0 // НЕОБЯЗАТЕЛЬНОЕ ПОЛЕ. Признак типа склада (0 или 1)
        }, 
        { //Дополнительный элемент массива, если чек содержит несколько товаров/услуг в "Positions"
            "Count": 10, 
            "Price": 2000,
            "TaxPercent": 12, 
            "Tax": 2035.71, 
            "TaxType": 100, 
            "PositionName": "Конфеты", 
            "PositionCode": "2", 
            "Discount": 1000, 
            "Markup": 0, 
            "SectionCode": "1", 
            "UnitCode": 796, 
            "Mark": 0, 
            "GTIN": "0001234560012",
            "NTIN": "0200000000002",
            "ProductId": 0,
            "WarehouseType": 0
        }
    ], 
    "TicketModifiers": [ // НЕОБЯЗАТЕЛЬНАЯ СТРУКТУРА. Скидка\Наценка на весь чек
        {
            "Sum": 150, // Сумма
            "Text": "Скидка по карте", // Наименование скидки\наценки
            "Type": 1, // Тип модификатора (1 – скидка, 2 - наценка)
            "TaxType": 100, // Тип налога
            "TaxPercent": 12, // Налоговая ставка
            "Tax": 16.07 // Налог (в тенге). Сумма всех налогов в чеке, с учетом налогов на сидку и наценку, должна быть положительной
        }, 
        {
            "Sum": 150, 
            "Text": "Наценка за обслуживание", 
            "Type": 2, 
            "TaxType": 100, 
            "TaxPercent": 12,
            "Tax": 16.07
        }
    ], 
    "Payments": [ // Оплата
        {
            "Sum": 18500, // Сумма
            "PaymentType": 1 // Тип оплаты (0 - наличные, 1 - банковская карта, 4 - мобильный платеж). Каждый тип платежа, используемый в чеке, должен встречаться не более одного раза
        }, 
        { // НЕОБЯЗАТЕЛЬНАЯ СЕКЦИЯ, достаточно только одной секции в "Payments"
            "Sum": 1000, 
            "PaymentType": 0
        }
    ], 
    "ReturnBasisDetails": { //Используется и обязательно ТОЛЬКО ДЛЯ ОПЕРАЦИЙ ВОЗВРАТОВ (1 - возврат покупки, 3 - возврат продажи). Структура содержит данные чека, на основе которого выполняется возврат. Обязательно для всех касс, работающих на версии протокола ОФД 2.0.3 или выше.
    "CheckNumber": "321520655220", //Фискальный признак чека-основания. Параметр указан на чеке-основании для возврата.
    "DateTime": "2025-09-10T06:22:21.567Z", //Дата-время чек-основания. Параметр указан на чеке-основании для возврата.
    "RegistrationNumber": "032600010253", //Регистрационный номер кассы (РНК/РНМ/Код ККМ КГД), на которой был оформлен чек-основание для возврата. Параметр указан на чеке-основании для возврата.
    "Total": 5000, //Общая сумма (Итого) чека-основания. Параметр указан на чеке-основании для возврата.
    "IsOffline": false //Признак автономности чека-основания для возврата (false - онлайн, true - чек сформирован в автономном режиме). Признак автономности указан на чеке-основании для возврата, если таких данных нет на чеке, значит чек свормирован в онлайн режиме.
  },
    "Change": 0, // НЕОБЯЗАТЕЛЬНОЕ ПОЛЕ. Сдача. ПРИМЕЧИЕ - Если данное поле не заполняется (null), то расчет сдачи осуществляется на стороне Webkassa
    "RoundType": 2, // Тип округления используемый в чеке. По умолчанию используется значение 2 (0 - без округления, 2- округление позиций, 3  округление только по итогу)
    "ExternalCheckNumber": "e4c89243-82nb-4622-9131-c8a93795d1ec", // ВАЖНОЕ ПОЛЕ, т.к. позволяет обеспечивать идемпотентность при сбоях в связи. Номер операции системы-источника
    "ExternalOrderNumber": "9739-c8a93595d2ec", // НЕОБЯЗАТЕЛЬНОЕ ПОЛЕ. Номер заказа - используется для продаж и возвратов. Максимальная длина - 200 символов.
    "CustomerEmail": "pochta@pochta.com", // НЕОБЯЗАТЕЛЬНОЕ ПОЛЕ. Email покупателя - при наличии электронного адреса покупателя Webkassa автоматически отправляет электронный чек покупателю
    "CustomerPhone": "+77771234455", // НЕОБЯЗАТЕЛЬНОЕ ПОЛЕ. Телефон покупателя
    "CustomerXin": "987654321012", // НЕОБЯЗАТЕЛЬНОЕ ПОЛЕ. ИИН/БИН покупателя
    "ExternalLinkId": "8339525d-6c98-4f06-8a79-e13b4508fb92", // НЕОБЯЗАТЕЛЬНОЕ ПОЛЕ. Может содержать только GUID. Идентификатор внешней ссылки для просмотра чека (или чеков) неавторизованными пользователями
    "PaperKind": 0 //Размер бумаги, для печатной формы чека, возвращаемой в структуре TicketPrintFormat. Доступные форматы: 0 - бумага шириной  80 мм, 3 - бумага шириной 57(58) мм, 12 - бумага формата A4 (книжная ориентация), 13 - бумага формата А4 (альбомная ориентация).  Если параметр не передан, по умолчанию применяется значение 0 (80 мм).
}
